# GroupLoadOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupLoadOptions Constructor
GroupLoadOptions Class See Also
---
Creates a new instance of a GroupLoadOptions object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public GroupLoadOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
GroupLoadOptions()
```

# See Also
GroupLoadOptions Class
Autodesk.Revit.DB Namespace